In [8]:
import sqlite3
import pandas as pd

In [9]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [10]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [11]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [12]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [13]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [74]:
tasks+=1
pd.read_sql(
    '''   
SELECT 'CRIM' AS Column_Name, COUNT(*) - COUNT(CRIM) AS Null_Count FROM boston
UNION ALL
SELECT 'ZN', COUNT(*) - COUNT(ZN) FROM boston
UNION ALL
SELECT 'INDUS', COUNT(*) - COUNT(INDUS) FROM boston
UNION ALL
SELECT 'CHAS', COUNT(*) - COUNT(CHAS) FROM boston
UNION ALL
SELECT 'NOX', COUNT(*) - COUNT(NOX) FROM boston;
    ''',
    con,
)

  Column_Name  Null_Count
0        CRIM           0
1          ZN           0
2       INDUS           0
3        CHAS           0
4         NOX           0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [75]:
tasks+=1
pd.read_sql(
    '''
SELECT 'CRIM' AS Column_Name, COUNT(DISTINCT CRIM) AS Unique_Count FROM boston
UNION ALL
SELECT 'ZN' AS Column_Name, COUNT(DISTINCT ZN) AS Unique_Count FROM boston
UNION ALL
SELECT 'INDUS' AS Column_Name, COUNT(DISTINCT INDUS) AS Unique_Count FROM boston
UNION ALL
SELECT 'CHAS' AS Column_Name, COUNT(DISTINCT CHAS) AS Unique_Count FROM boston
UNION ALL
SELECT 'NOX' AS Column_Name, COUNT(DISTINCT NOX) AS Unique_Count FROM boston;
    ''',
    con,
)

  Column_Name  Unique_Count
0        CRIM           504
1          ZN            26
2       INDUS            76
3        CHAS             2
4         NOX            81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [76]:
tasks+=1
pd.read_sql(
    '''
         SELECT
        (SELECT (max(CRIM)+min(CRIM))/ 2 FROM boston) AS mid_CRIM,
        (SELECT (max(ZN)+min(ZN))/ 2 FROM boston) AS mid_ZN,
        (SELECT (max(INDUS)+min(INDUS))/ 2 FROM boston) AS mid_INDUS,
        (SELECT (max(CHAS)+min(CHAS))/ 2 FROM boston) AS mid_CHAS,
        (SELECT (max(NOX)+min(NOX))/ 2 FROM boston) AS mid_NOX
    FROM boston
    LIMIT 1;
    ''',
    con,
)

#CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è –ø–æ –≥–æ—Ä–æ–¥–∞–º –æ—á–µ–Ω—å –≤—ã—Å–æ–∫–∏–π, –∞ –¥–æ–ª—è –∂–∏–ª–æ–π –∑–µ–º–ª–∏ –Ω–∏–∑–∫–∞—è

   mid_CRIM  mid_ZN  mid_INDUS  mid_CHAS  mid_NOX
0  44.49126    50.0       14.1       0.5    0.628

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [66]:
tasks+=1
pd.read_sql(
    '''
WITH MostExpensive AS (
  SELECT AVG(RM) AS AvgRMExpensive
  FROM (
    SELECT RM
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1
  )
),
CheapestGroups AS (
  SELECT
    COUNT(*) OVER () AS NumHouses,
    AVG(RM) OVER (ORDER BY MEDV ASC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS AvgRMCheapest
  FROM boston
),
Differences AS (
  SELECT
    NumHouses,
    AvgRMCheapest,
    (SELECT AvgRMExpensive FROM MostExpensive) AS AvgRMExpensive,
    (SELECT AvgRMExpensive FROM MostExpensive) - AvgRMCheapest AS Difference
  FROM CheapestGroups
  WHERE NumHouses IN (25, 50, 100, 200, 300)
)
SELECT * FROM Differences
ORDER BY NumHouses;


    ''',
    con,
)

Empty DataFrame
Columns: [NumHouses, AvgRMCheapest, AvgRMExpensive, Difference]
Index: []

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [73]:
tasks+=1
pd.read_sql(
    '''

SELECT LSTAT, MEDV, rank () over (order by MEDV desc) as rank
FROM boston
group by MEDV 




    ''',
    con,
)

# –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–π –ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è

     LSTAT  MEDV  rank
0     1.73  50.0     1
1     5.91  48.8     2
2     3.81  48.5     3
3     3.95  48.3     4
4     3.92  46.7     5
..     ...   ...   ...
224  30.81   7.2   225
225  36.98   7.0   226
226  29.97   6.3   227
227  26.77   5.6   228
228  30.59   5.0   229

[229 rows x 3 columns]

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [68]:
tasks+=1
pd.read_sql(
    '''
SELECT avg(MEDV) as avg_price,
case
WHEN CHAS = 0 THEN "–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç"
WHEN CHAS = 1 THEN '–≥—Ä–∞–Ω–∏—á–∏—Ç'
END as CHAS
FROM boston
where CHAS = 1
union all
SELECT avg(MEDV) as avg_price,
case
WHEN CHAS = 0 THEN "–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç"
WHEN CHAS = 1 THEN '–≥—Ä–∞–Ω–∏—á–∏—Ç'
END as CHAS
FROM boston
where CHAS = 0


    ''',
    con,
)

   avg_price         CHAS
0  28.440000     –≥—Ä–∞–Ω–∏—á–∏—Ç
1  22.093843  –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç




7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [69]:
tasks+=1
pd.read_sql(
    '''
   SELECT
  'CRIM' AS avg_CRIM,
  AVG(CASE WHEN CHAS = 1 THEN CRIM ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN CRIM ELSE NULL END) AS avg_no_river
FROM boston
HAVING avg_river > avg_no_river
UNION ALL
SELECT
  'ZN' AS avg_ZN,
  AVG(CASE WHEN CHAS = 1 THEN ZN ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN ZN ELSE NULL END) AS avg_no_river
FROM boston
group by ZN
HAVING avg_river > avg_no_river
UNION ALL
SELECT
  'INDUS' AS avg_INDUS,
  AVG(CASE WHEN CHAS = 1 THEN INDUS ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN INDUS ELSE NULL END) AS avg_no_river
FROM boston
HAVING avg_river > avg_no_river
UNION ALL
SELECT
  'NOX' AS avg_NOX,
  AVG(CASE WHEN CHAS = 1 THEN NOX ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN NOX ELSE NULL END) AS avg_no_river
FROM boston
HAVING avg_river > avg_no_river;
    
    ''',
    con,
)

  avg_CRIM  avg_river  avg_no_river
0    INDUS  12.719143     11.019193
1      NOX   0.593426      0.551817

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [47]:
tasks+=1
pd.read_sql(
    '''
WITH Percentiles AS (
  SELECT
    INDUS,
    NOX,
    NTILE(10) OVER (ORDER BY INDUS) AS IndusPercentile,
    NTILE(10) OVER (ORDER BY NOX) AS NoxPercentile
  FROM boston
)
SELECT
  DISTINCT IndusPercentile * 10 AS percentile,
  MAX(CASE WHEN IndusPercentile = NoxPercentile THEN INDUS END)
    OVER (PARTITION BY IndusPercentile) AS INDUS,
  MAX(CASE WHEN IndusPercentile = NoxPercentile THEN NOX END)
    OVER (PARTITION BY NoxPercentile) AS NOX
FROM Percentiles
ORDER BY percentile;



    ''',
    con,
)

#–∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ –≤–∞—Ä–∏—Ä—É–µ—Ç—Å—è 0,4 –¥–æ 0,8 –Ω–µ –∑–∞–≤–∏—Å–∏–º–æ –æ—Ç –¥–æ–ª–∏ –∞–∫—Ä–æ–≤

    percentile  INDUS    NOX
0           10   2.68  0.422
1           10   2.68  0.442
2           10   2.68  0.453
3           10   2.68  0.507
4           10   2.68  0.538
5           20   4.39  0.422
6           20   4.39  0.442
7           20   4.39  0.453
8           20   4.39  0.507
9           20   4.39  0.538
10          20   4.39  0.573
11          20   4.39  0.671
12          30   5.13  0.422
13          30   5.13  0.442
14          30   5.13  0.453
15          30   5.13  0.507
16          30   5.13  0.538
17          40   7.38  0.422
18          40   7.38  0.442
19          40   7.38  0.453
20          40   7.38  0.507
21          40   7.38  0.538
22          50   8.56  0.507
23          50   8.56  0.538
24          50   8.56  0.573
25          50   8.56  0.597
26          60  13.89  0.422
27          60  13.89  0.442
28          60  13.89  0.507
29          60  13.89  0.573
30          60  13.89  0.597
31          70  18.10  0.442
32          70  18.10  0.453
33          70  18.10  0.538
34          70  18.10  0.573
35          70  18.10  0.597
36          70  18.10  0.671
37          80  18.10  0.671
38          80  18.10  0.713
39          90  18.10  0.597
40          90  18.10  0.713
41          90  18.10  0.871
42         100  19.58  0.597
43         100  19.58  0.671
44         100  19.58  0.871

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [48]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ